Revit 2027 API
GroupLoadOptions.IncludeAttachedDetails Property
 True if attached detail groups should be included, false otherwise. The default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeAttachedDetails { get; set; }
Public Property IncludeAttachedDetails As Boolean
	Get
	Set
public:
property bool IncludeAttachedDetails {
	bool get ();
	void set (bool value);
}
member IncludeAttachedDetails : bool with get, set
Property Value
Boolean
See Also
Reference
GroupLoadOptions Class
Autodesk.Revit.DB Namespace